function [P_BR,P_BL,RU] = assemble_P_Elem(U,R,UL,RR,Env,N,h)
%函数 assemble_P_Elem 组装P方程里的矩阵
%   输入变量：N为单元数，h为步长,U,R向量，UL,RR,分别为边界处理后的U,R
%   输出变量：
%                    P_BR,P_BL关于P方程边界右端点的总刚矩阵,左端点的总刚矩阵,
%                    RU为关于U，R和基函数相乘后求积组成的向量

%预分配
bl = zeros(3,1);
br = zeros(3,1);
P_BR=zeros(3*N,1);
P_BL=zeros(3*N,1);
RU=zeros(3*N,1);

%求RU，及组装
for i=1:N
    a=Env(i,1);
    b=Env(i,2);
    mid=(a+b)/2;
    %三个系数
    r(1:3,1)=R(3*i-2:3*i,1);
    u(1:3,1)=U(3*i-2:3*i,1);
    %基函数分别如下
    f1=@(x)(1);
    f2=@(x)(x-mid);
    f3=@(x)((x-mid).^2);
 
    %被积函数是R，U，PHI求导后的函数，三者的乘积
    F1=0;
    F2=@(x)((r(1,1)*f1(x)+r(2,1)*f2(x)+r(3,1)*f3(x)).*(u(1,1)*f1(x)+u(2,1)*f2(x)+u(3,1)*f3(x)));
    F3=@(x)((r(1,1)*f1(x)+r(2,1)*f2(x)+r(3,1)*f3(x)).*(u(1,1)*f1(x)+u(2,1)*f2(x)+u(3,1)*f3(x)).*(2*(x-mid)));
    %利用求积函数进行求积运算
    quad1 = 0;
    quad2 = quadrature(F2,a,b);
    quad3 = quadrature(F3,a,b);
    
    % 组装RU
    RU(3*i-2:3*i,1)=[quad1,quad2,quad3]';
end
% for i=1:N
%     br=[(RR(3*i-2:3*i,1)'*[1,-h/2,h^2/4]')*(U(3*i-2:3*i,1)'*[1,h/2,h^2/4]'),...
%         (RR(3*i-2:3*i,1)'*[1,-h/2,h^2/4]')*(U(3*i-2:3*i,1)'*[1,h/2,h^2/4]')*(h/2),...
%         (RR(3*i-2:3*i,1)'*[1,-h/2,h^2/4]')*(U(3*i-2:3*i,1)'*[1,h/2,h^2/4]')*(h^2/4)]';
%    P_BR(3*i-2:3*i,1)=br;
%     
%     bl=[(R(3*i-2:3*i,1)'*[1,-h/2,h^2/4]')*(UL(3*i-2:3*i,1)'*[1,h/2,h^2/4]'),...
%         (R(3*i-2:3*i,1)'*[1,-h/2,h^2/4]')*(UL(3*i-2:3*i,1)'*[1,h/2,h^2/4]')*(-h/2),...
%         (R(3*i-2:3*i,1)'*[1,-h/2,h^2/4]')*(UL(3*i-2:3*i,1)'*[1,h/2,h^2/4]')*(h^2/4)]';
%     P_BL(3*i-2:3*i,1)=bl;
% end

% 求P_BR,P_BL关于P方程边界右端点的总刚矩阵,左端点的总刚矩阵，组装
for i=1:N
    r(1:3,1)=R(3*i-2:3*i,1);
    u(1:3,1)=U(3*i-2:3*i,1);
    rr(1:3,1)=RR(3*i-2:3*i,1);
    ul(1:3,1)=UL(3*i-2:3*i,1);
    %局部
    br=[(rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4))*(u(1,1)+u(2,1)*(h/2)+u(3,1)*(h^2/4)),...
        (rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4))*(u(1,1)+u(2,1)*(h/2)+u(3,1)*(h^2/4))*(h/2),...
        (rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4))*(u(1,1)+u(2,1)*(h/2)+u(3,1)*(h^2/4))*(h^2/4)
    ]';
%组装
 P_BR(3*i-2:3*i,1)=br;
 %局部
 bl=[(r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4))*(ul(1,1)+ul(2,1)*(h/2)+ul(3,1)*(h^2/4)),...
     (r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4))*(ul(1,1)+ul(2,1)*(h/2)+ul(3,1)*(h^2/4))*(-h/2),...
     (r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4))*(ul(1,1)+ul(2,1)*(h/2)+ul(3,1)*(h^2/4))*(h^2/4)
    ]';
%组装
 P_BL(3*i-2:3*i,1)=bl;
 end

end


