function [QT_BR,QT_BL,RUP] = assemble_QT_Elem(U,R,UL,RR,P,Env,N,h)
%函数 assemble_QT_Elem 组装QT方程里的矩阵
%   输入变量：N为单元数，h为步长,U,R向量，UL,RR,P
%   输出变量：RUP为u,r,p三个函数相乘求积，组成向量
%                    QT_BR,QT_BL关于QT方程边界右端点的总刚矩阵,左端点的总刚矩阵
%                       

%预分配
bl = zeros(3,1);
br = zeros(3,1);
QT_BR=zeros(3*N,1);
QT_BL=zeros(3*N,1);
RUP=zeros(3*N,1);
%求RUP
for i=1:N
    a=Env(i,1);
    b=Env(i,2);
    mid=(a+b)/2;
    %三个系数
    r(1:3,1)=R(3*i-2:3*i,1);
    u(1:3,1)=U(3*i-2:3*i,1);
    p(1:3,1)=P(3*i-2:3*i,1);
    %基函数分别如下
    f1=@(x)(1);
    f2=@(x)(x-mid);
    f3=@(x)((x-mid).^2);
    %
    %被积函数是R，U，PHI求导后的函数乘以相应的基函数导数
    F1=0;
    F2=@(x)(1/2*(r(1,1)*f1(x)+r(2,1)*f2(x)+r(3,1)*f3(x)).^2+3/2*(u(1,1)*f1(x)+u(2,1)*f2(x)+u(3,1)*f3(x)).^2-(p(1,1)*f1(x)+p(2,1)*f2(x)+p(3,1)*f3(x)));
    F3=@(x)2*(1/2*(r(1,1)*f1(x)+r(2,1)*f2(x)+r(3,1)*f3(x)).^2+3/2*(u(1,1)*f1(x)+u(2,1)*f2(x)+u(3,1)*f3(x)).^2-(p(1,1)*f1(x)+p(2,1)*f2(x)+p(3,1)*f3(x))).*(x-mid);
    
    %利用求积函数进行求积运算
    quad1 = 0;
    quad2 = quadrature(F2,a,b);
    quad3 = quadrature(F3,a,b);
    % 组装成RUP
    RUP(3*i-2:3*i,1)=[quad1,quad2,quad3]';
end
    
%边界处理p的右端点
for i=1:N-1
    PR(3*i-2:3*i,1)=P(3*i+1:3*i+3,1);
end
PR(3*N-2:3*N,1)=P(1:3,1);

%单元循环，组装
for i=1:N
    %三个系数
    r(1:3,1)=R(3*i-2:3*i,1);
    u(1:3,1)=U(3*i-2:3*i,1);
    p(1:3,1)=P(3*i-2:3*i,1);
    ul(1:3,1)=UL(3*i-2:3*i,1);
    pr(1:3,1)=PR(3*i-2:3*i,1);
    rr(1:3,1)=RR(3*i-2:3*i,1);
    
    br1=(1/2*(rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4))+3/2*(u(1,1)+u(2,1)*(h/2)+u(3,1)*(h^2/4))^2-(pr(1,1)+pr(2,1)*(-h/2)+pr(3,1)*(h^2/4)));
    br2=(1/2*(rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4))+3/2*(u(1,1)+u(2,1)*(h/2)+u(3,1)*(h^2/4))^2-(pr(1,1)+pr(2,1)*(-h/2)+pr(3,1)*(h^2/4)))*(h/2);
    br3=(1/2*(rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4))+3/2*(u(1,1)+u(2,1)*(h/2)+u(3,1)*(h^2/4))^2-(pr(1,1)+pr(2,1)*(-h/2)+pr(3,1)*(h^2/4)))*(h^2/4);
    
    br=[br1,br2,br3]';
    %组装
   QT_BR(3*i-2:3*i,1)=br;
    
    bl1=(1/2*(r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4))+3/2*(ul(1,1)+ul(2,1)*(h/2)+ul(3,1)*(h^2/4))^2-(p(1,1)+p(2,1)*(-h/2)+p(3,1)*(h^2/4)));
    bl2=(1/2*(r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4))+3/2*(ul(1,1)+ul(2,1)*(h/2)+ul(3,1)*(h^2/4))^2-(p(1,1)+p(2,1)*(-h/2)+p(3,1)*(h^2/4)))*(-h/2);
    bl3=(1/2*(r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4))+3/2*(ul(1,1)+ul(2,1)*(h/2)+ul(3,1)*(h^2/4))^2-(p(1,1)+p(2,1)*(-h/2)+p(3,1)*(h^2/4)))*(h^2/4);
    
     bl=[bl1,bl2,bl3]';
     %组装
    QT_BL(3*i-2:3*i,1)=bl;
end

end


