function [P_BR,P_BL,RU,FP] = assemble_P(U,R,UR,RL,Env,N,h)
%函数 assemble_P组装P方程里的矩阵
%   输入变量：N为单元数，h为步长,U,R向量，UR,RL,分别为边界处理后的U,R
%   输出变量：
%                    P_BR,P_BL关于P方程边界右端点的总刚矩阵,左端点的总刚矩阵,
%                    RU为关于U，R和基函数相乘后求积组成的向量

%预分配
bl = zeros(3,1);
br = zeros(3,1);
P_BR=zeros(3*N,1);
P_BL=zeros(3*N,1);
RU=zeros(3*N,1);
FP=zeros(3*N,1);

%求RU，及组装
for i=1:N
    a=Env(i,1);
    b=Env(i,2);
    mid=(a+b)/2;
    %三个系数
    r(1:3,1)=R(3*i-2:3*i,1);
    u(1:3,1)=U(3*i-2:3*i,1);
    
    %被积函数是R，U，PHI求导后的函数，三者的乘积
    F2=@(x)((r(1,1)+r(2,1)*(x-mid)+r(3,1)*(x-mid).^2).*(u(1,1)+u(2,1)*(x-mid)+u(3,1)*(x-mid).^2));
    F3=@(x)((r(1,1)+r(2,1)*(x-mid)+r(3,1)*(x-mid).^2).*(u(1,1)+u(2,1)*(x-mid)+u(3,1)*(x-mid).^2).*(2*(x-mid)));
    %利用求积函数进行求积运算
    quad1 = 0;
    quad2 = quadrature(F2,a,b);
    quad3 = quadrature(F3,a,b);
    % 组装RU
    RU(3*i-2:3*i,1)=[quad1,quad2,quad3]';
end

%RR向量由R向量向右平移一个单元
RR=zeros(3*N,1);
RR(3*N-2:3*N,1)=R(1:3,1);
for i=1:N-1
    RR(3*i-2:3*i,1)=R(3*i+1:3*i+3,1);
end

% 求P_BR,P_BL关于P方程，边界右端点的总刚矩阵,左端点的总刚矩阵，组装
for i=1:N
    %三个系数
    r(1:3,1)=R(3*i-2:3*i,1);
    u(1:3,1)=U(3*i-2:3*i,1);
    ur(1:3,1)=UR(3*i-2:3*i,1);
    rl(1:3,1)=RL(3*i-2:3*i,1);
    rr(1:3,1)=RR(3*i-2:3*i,1);
    
    brr=(1/2*(rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4))^2-1/2*(r(1,1)+r(2,1)*(h/2)+r(3,1)*(h^2/4))^2)/((rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4))-(r(1,1)+r(2,1)*(h/2)+r(3,1)*(h^2/4)));
    brl=(1/2*(r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4))^2-1/2*(rl(1,1)+rl(2,1)*(h/2)+rl(3,1)*(h^2/4))^2)/((r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4))-(rl(1,1)+rl(2,1)*(h/2)+rl(3,1)*(h^2/4)));
    br=[brr*(ur(1,1)+ur(2,1)*(-h/2)+ur(3,1)*(h^2/4)),...
          brr*(ur(1,1)+ur(2,1)*(-h/2)+ur(3,1)*(h^2/4))*(h/2),...
          brr*(ur(1,1)+ur(2,1)*(-h/2)+ur(3,1)*(h^2/4))*(h^2/4)]';
    bl=[brl*(u(1,1)+u(2,1)*(-h/2)+u(3,1)*(h^2/4)),...
          brl*(u(1,1)+u(2,1)*(-h/2)+u(3,1)*(h^2/4))*(-h/2),...
          brl*(u(1,1)+u(2,1)*(-h/2)+u(3,1)*(h^2/4))*(h^2/4)]';
%     %局部
%     br=[1/2*(rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4)+r(1,1)+r(2,1)*(h/2)+r(3,1)*(h^2/4))*(ur(1,1)+ur(2,1)*(-h/2)+ur(3,1)*(h^2/4)),...
%           1/2*(rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4)+r(1,1)+r(2,1)*(h/2)+r(3,1)*(h^2/4))*(ur(1,1)+ur(2,1)*(-h/2)+ur(3,1)*(h^2/4))*(h/2),...
%           1/2*(rr(1,1)+rr(2,1)*(-h/2)+rr(3,1)*(h^2/4)+r(1,1)+r(2,1)*(h/2)+r(3,1)*(h^2/4))*(ur(1,1)+ur(2,1)*(-h/2)+ur(3,1)*(h^2/4))*(h^2/4)
%         ]';
%     %组装
%     P_BR(3*i-2:3*i,1)=br;
%     
%     
%     %局部
%     bl=[1/2*(r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4)+rl(1,1)+rl(2,1)*(h/2)+rl(3,1)*(h^2/4))*(u(1,1)+u(2,1)*(-h/2)+u(3,1)*(h^2/4)),...
%           1/2*(r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4)+rl(1,1)+rl(2,1)*(h/2)+rl(3,1)*(h^2/4))*(u(1,1)+u(2,1)*(-h/2)+u(3,1)*(h^2/4))*(-h/2),...
%           1/2*(r(1,1)+r(2,1)*(-h/2)+r(3,1)*(h^2/4)+rl(1,1)+rl(2,1)*(h/2)+rl(3,1)*(h^2/4))*(u(1,1)+u(2,1)*(-h/2)+u(3,1)*(h^2/4))*(h^2/4)
%          ]';
%     %组装
    P_BR(3*i-2:3*i,1)=br;
    P_BL(3*i-2:3*i,1)=bl;
end
%右端项
FP=-RU+P_BR-P_BL;
end


